"""
Вариант 27

Организовать словарь на 10 англо-русских слов, обеспечивающий
"перевод" английского слова на русский.

"""


wordbook = {
    "mother": "мама", "father": "папа", "apple": "яблоко", "cucumber": "огурец", "teacher": "учитель",
    "water": "вода", "door": "дверь", "student": "студент", "shcool": "школа", "programming": "программирование",
}

def Translate(word):
    try:
        print(f'-----------\n{wordbook[word.lower()]}\n-----------')
    except:
        print('[ERROR] -- похоже слово отсутствует в словаре, попробуйте заново!')
        Translate(word=input('Введите слово, которе хотите перевести: '))

if __name__ == '__main__':
    Translate(word=input('Введите слово, которе хотите перевести: '))